const SIMILAR_PHOTOS_COUNT = 25;
const SIMILAR_COMMENT_COUNT = 30;
const MIN_LIKES = 15;
const MAX_LIKES = 200;
const SIMILAR_AVATAR_COUNT = 6;

const DESCRIPTION = [
  'Солнечный пляж, песчаные дюны.',
  'Лесная тропа, шорох листьев.',
  'Капли дождя, окно дождливого дня.',
  'Горы, тающий снег, свежий воздух.',
  'Цветочный букет, яркие лепестки.',
  'Звёздное небо, молчаливые мечты.',
  'Уютный камин, мерцающий огонь.',
  'Старый мост, рекой века.',
  'Ночной город, огни и тени.',
  'Красный закат, прощание солнца.',
  'Летняя гроза, серебристые молнии.',
  'Американский динер, шумный завтрак.',
  'Бурное море, солёный ветер.',
  'Радуга, после дождя.',
  'Улыбающийся ребёнок, мир беззаботства.',
  'Мягкий ковёр, уютные тапочки.',
  'Старины архитектура, величие истории.',
  'Весенний сад, расцвет нежности.',
  'Зимний пейзаж, снежная тишина.',
  'Гитара, мелодия покоя.',
  'Кофейная чашка, утренний ритуал.',
  'Праздничный салют, радуга огней.',
  'Лунный свет, нежная сказка.',
  'Молоко, свежая булка.',
  'Старинная книга, загадочные страницы.'
];

const COMMENTS = [
  'Всё отлично!',
  'В целом всё неплохо. Но не всё.',
  'Когда вы делаете фотографию, хорошо бы убирать палец из кадра. В конце концов это просто непрофессионально.',
  'Моя бабушка случайно чихнула с фотоаппаратом в руках и у неё получилась фотография лучше.',
  'Я поскользнулся на банановой кожуре и уронил фотоаппарат на кота и у меня получилась фотография лучше.',
  'Лица у людей на фотке перекошены, как будто их избивают. Как можно было поймать такой неудачный момент?!'
];

const NAMES = [
  'Александр',
  'Мария',
  'Дмитрий',
  'Елена',
  'Константин',
  'Анна',
  'Сергей',
  'Наталья',
  'Виктор',
  'Ольга',
  'Илья',
  'Татьяна'
];

export {MAX_LIKES, MIN_LIKES, SIMILAR_PHOTOS_COUNT, SIMILAR_COMMENT_COUNT, SIMILAR_AVATAR_COUNT, DESCRIPTION, COMMENTS, NAMES};
